0.1.0/tutorials/incompressible/adjoint-shape-optimization/pitz_daily/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     adjoint-shape-optimization;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression off;
timeFormat      general;
timePrecision   12;
runTimeModifiable true;

// vim: set ft=foam et sw=2 ts=2 sts=2:
